armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F10x/Keil.STM32F1xx_DFP.pdsc
        <!-- *************************  Device 'STM32F100VC'  ***************************** -->
        <device Dname="STM32F100VC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F100VD'  ***************************** -->
        <device Dname="STM32F100VD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F100VE'  ***************************** -->
        <device Dname="STM32F100VE">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="16"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F100ZC'  ***************************** -->
        <device Dname="STM32F100ZC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="16"/>
          <feature type="IOs"           n="112"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'STM32F100ZD'  ***************************** -->
        <device Dname="STM32F100ZD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="112"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'STM32F100ZE'  ***************************** -->
        <device Dname="STM32F100ZE">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="112"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F101'  **************************** -->
      <subFamily DsubFamily="STM32F101">

        <debugvars configfile="Debug/STM32F101_102_103_105_107.dbgconf" version="1.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
        </debugvars>

        <book name="Documents/CD00171190.pdf" title="STM32F101xx, STM32F102xx, STM32F103xx, STM32F105xx, STM32F107xx Reference Manual"/>
        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="Temp"          n="-40"     m="105"/>

