armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F10x/Keil.STM32F1xx_DFP.pdsc
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32F1xx CMSIS RTOS I2C">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/Touch_STMPE811.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Keil" name="MCBSTM32C" revision="Ver 2.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBSTM32C=ON">
      <description>Keil MCBSTM32C Development Board</description>
      <image small="Boards/Keil/MCBSTM32C/Documentation/mcbstm32c_small.jpg"
             large="Boards/Keil/MCBSTM32C/Documentation/mcbstm32c_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbstm32c/" title="MCBSTM32C Evaluation Board Web Page"/>
      <book category="setup"     name="Boards/Keil/MCBSTM32C/Documentation/STM32C_QSG.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="Boards/Keil/MCBSTM32C/Documentation/mcbstm32c-base-board-schematics.pdf" title="Base Board Schematics"/>
      <book category="schematic" name="Boards/Keil/MCBSTM32C/Documentation/mcbstm32c-display-board-schematics.pdf" title="Display Board Schematics"/>
      <book category="manual"    name="Boards/Keil/MCBSTM32C/Documentation/mcbstm32c.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F107VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F105"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F107"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="ROM"             n="1"              name="8 kByte I2C EEPROM"/>
      <feature type="Proto"           n="6"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="80"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed, Host/Device, OTG"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Gyro"            n="1"              name="3-axis digital output gyroscope"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Accelerometer"   n="1"              name="3-axis digital Accelerometer"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"             n="8"              name="LEDs directly connected to port pins"/>
      <feature type="CustomFF"        n="115" m="115"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board vendor="Keil" name="MCBSTM32E" revision="Ver 3.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBSTM32EXL=ON">
      <description>Keil MCBSTM32E Development Board</description>
      <image small="Boards/Keil/MCBSTM32E/Documentation/mcbstm32e_small.jpg"
             large="Boards/Keil/MCBSTM32E/Documentation/mcbstm32e_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbstm32e/" title="MCBSTM32E Evaluation Board Web Page"/>
      <book category="setup"     name="Boards/Keil/MCBSTM32E/Documentation/STM32E_QSG.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="Boards/Keil/MCBSTM32E/Documentation/mcbstm32e-base-board-schematics.pdf" title="Base Board Schematics"/>
      <book category="schematic" name="Boards/Keil/MCBSTM32E/Documentation/mcbstm32e-display-board-schematics.pdf" title="Display Board Schematics"/>
      <book category="manual"    name="Boards/Keil/MCBSTM32E/Documentation/mcbstm32e.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F103ZG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F103"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="RAM"             n="1"              name="1 MByte SRAM"/>
      <feature type="ROM"             n="1"              name="8 MByte SPI Flash"/>
      <feature type="Proto"           n="6"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="42"             name="GPIOs (maximum)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed Device"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"             n="8"              name="LEDs directly connected to port pins"/>
      <feature type="CustomFF"        n="110" m="140"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- MCBSTM32E Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCBSTM32E/Blinky">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Keil/MCBSTM32E/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards/Keil/MCBSTM32E/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

